# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

# --------------------------------------------------------------------------------------------------

# Team.create(:name => "JobRainbow", :text => "JobRainbow", :link_url => "star-k-dcs.wix.com/jobrainbowlp", :leader => "五十嵐唯")
# Team.create(:name => "PatientStory", :text => "PatientStory", :link_url => "", :leader => "上村成章")
# Team.create(:name => "Honyamorakes", :text => "Honyamorakes", :link_url => "", :leader => "竹田聖")
# Team.create(:name => "Team Mami", :text => "Team Mami", :link_url => "", :leader => "川口真美")
# Team.create(:name => "ふっとんふっとんだーず", :text => "ふっとんふっとんだーず", :link_url => "", :leader => "網谷泰平")

#--------------------------------------------------------------------------------------------------

# Speaker.create(:name => "吉田浩一郎",
#                :job  => "株式会社クラウドワークス代表取締役社長 兼 CEO",
#                :carrier => "1974年兵庫県神戸市生まれ。東京学芸大学卒業後、パイオニア、リードエグジビションジャパンなどを経て、ドリコム執行役員として東証マザーズ上場を経験した後に独立。事業を拡大する中で、ITを活用した時間や場所にこだわらない働き方に着目、2011年11月に株式会社クラウドワークスを創業。翌年3月にサービスを開始したクラウドソーシングサービス『クラウドワークス』（http://crowdworks.jp/）は「'働く'を通して人々に笑顔を」をミッションとして事業を展開。2014年12月東証マザーズ上場。2015年11月現在、登録会員は75万人、利用企業は上場企業をはじめとして11万社にのぼる。2015年には、経済産業省 第1回「日本ベンチャー大賞」審査委員会特別賞を受賞、グッドデザイン・未来づくりデザイン賞受賞。著書に『クラウドワーキングで稼ぐ! ―時間と場所にとらわれない新しい働き方（日経新聞出版社）』『クラウドソーシングでビジネスはこう変わる（ダイヤモンド社）』などがある。",
#                :introduce => "インターネットで仕事を受発注することができる、ユーザー75万人、利用企業11万社超の日本最大級のクラウドソーシングサービス「クラウドワークス」を展開。個人にとっては時間や場所にとらわれない新しい働き方、企業にとっては柔軟かつスピーディで費用対効果の高い、新しい人材活用のあり方を提供いたします。",
#                :message => "comming soon..."
#                );
# Speaker.create(:name => "川添高志",
#                :job  => "ケアプロ株式会社代表取締役",
#                :carrier => "1982年横浜市出身。05年3月、慶應義塾大学看護学部卒業。看護師・保健師。経営コンサルティング会社、東京大学病院を経て、07年12月起業。世界経済フォーラム（ダボス会議）グローバルシェイパーやアショカフェローに選出。",
#                :introduce => "「ワンコイン健診」と「２４時間訪問看護」を展開。最近は、インドに子会社を作り、インドの予防医療にも貢献。",
#                :message => "comming soon..."
#                );
# Speaker.create(:name => "徳重徹",
#                :job  => "テラモーターズ株式会社代表取締役",
#                :carrier => "1970年、山口県出身。九州大学工学部卒。住友海上火災保険（当時）に入社し商品企画・経営企画等に従事。退社後、米サンダーバード国際経営大学院に自費留学しMBAを取得、シリコンバレーに渡り、コア技術ベンチャーの投資・ハンズオン支援を行う。帰国後、2010年4月にテラモーターズ設立。電動バイク、電動シニアカー市場で設立から2年で販売台数4000台を達成。今年5月には、日本企業初となる電動三輪の認証をインドの公的機関より獲得した。",
#                :introduce => "「アップルを超える企業になる」 テラモーターズのオフィスには創業以来、この言葉を掲げています。 2010年に創業し、本社は東京•渋谷の雑居ビルにあるレンタルオフィス。この４畳半ほどのスペースから世界一の企業を目指しています。 創業二年目には約3,000台を売り、国内の電動バイクメーカーのトップとなりました。 しかし、見据えているのは国内のシェア争いではありません。その先のもっと大きなビッグビジネスであり、 現在、メガベンチャーへの足がかりとしてインドやベトナムといったアジア諸国への進出を進めています。",
#                :message => "日本のおかれた状況をまさに自分のこととして考えて
# 自分が今、何ができるのかを考え、そして具体的なアクションをする。
# 特に気合が入っている人には、戦略的思考を。色々考え、戦略思考がある人は具体的なアクションを起こしていただきたいと思います。
# そうすることで、自分が今まで考えていた悩みが非常に小さいことだとわかり、今自分が何をしなければならないのかということ見えてくると思います。日本の歴史を見たときに変革期に時代を変えてきたのは若者の情熱と心意気です。日本の再生の為にも共にがんばっていけたらと思います。"
#                );

# Speaker.create(:name => "松永友貴",
#                :job  => "株式会社ユナイテッド代表取締役社長COO",
#                :carrier => "慶應義塾大学総合政策学部卒業後、 リーマン・ブラザーズ証券会社投資銀行本部に入社。 その後、米国シリコンバレーのVCドレーパー・フィッシャー・ジャーベットソンを経て、 2002年インキュベーション・オフィスを運営する(株) アップステアーズを設立し代表取締役に就任。 2004年に同社をネットエイジキャピタルパートナーズ (株)（現 ユナイテッド(株)）へ売却。 2007年、ngi group(株) （現 ユナイテッド(株)）取締役兼執行役COO兼投資事業本部長に就任。 2009年2月より当社代表執行役社長を経て、 2012年12月スパイアと合併し、ユナイテッド（株）代表取締役社長COOに就任（現任）。",
#                :introduce => "ユナイテッドは「日本を代表するインターネット企業になる」をビジョンに掲げ、 ゲーム領域からエンターテイメント領域までを手掛ける  「スマートフォンアプリ事業」と 、 インターネット広告(特にスマートフォン)の領域で 最先端の技術を駆使した「アドテク事業」の 二つの事業を中心に展開をしている会社です。",
#                :message => "「まだ見ぬ世界を見て走る」

# これは私のブログのトップに掲載をしている言葉です。
# まだ世の中に無い、誰も見たことのない事業やサービスが、
# これからの世界を創っていきます。
# それを想像し創っていくのは若い世代の皆さんです。
# だからこそ、どんな困難があっても、
# まだ見ぬ世界を目指して走り続けて欲しいと思います。"
#                );

# Speaker.create(:name => "夏野剛",
#                :job  => "慶應義塾大学大学院政策・メディア研究科/特別招聘教授",
#                :carrier => "1988年早稲田大学政治経済学部卒、東京ガス入社。95年ペンシルバニア大学経営大学院（ウォートンスクール）卒。
# ベンチャー企業副社長を経て、97年NTTドコモへ。99年に「iモード」、その後「デコメ」「おサイフケータイ」などの
# 多くのサービスを立ち上げた。
# 現在は慶應大学の特別招聘教授のほか、カドカワ、トランスコスモス、セガサミーホールディングス、ぴあ、グリー、DLE、U-NEXTなどの取締役を兼任。フジテレビ「とくダネ！」などのテレビ番組や新聞、雑誌、インターネットにおけるメディア登場数も多い。　ダボス会議で知られるWorldEconomic Forum の“Global Agenda Council”メンバ-。経済産業省所轄の未踏IT人材発掘・育成事業の統括プロジェクトマネージャー、一般社団法人未踏の理事。東京オリンピック・パラリンピック競技大会組織委員会参与。内閣官房クールジャパン推進会議構成員など、政府機関等のブレーンとしても活躍する。ツイッターアカウントは@tnatsu",
#                :introduce => "",
#                :message => "大学時代はあっという間です。自由な時間の中で何を選択するのかは、自分自身が
# 決めること。自分の意識次第で、様々な人との出会い、経験のチャンスが大きく
# 変わってきます。広い視野を持ちつつ、自分が好きなものを突き詰め、こだわりを
# 持ちながら有意義な学生生活を送ってください。"
#                );

# Speaker.create(:name => "",
#                :job  => "",
#                :carrier => "",
#                :introduce => "",
#                :message => ""
#                );

# --------------------------------------------------------------------------------------------------

# devise


# --------------------------------------------------------------------------------------------------